## Plan Result (sbox_shutter_webapp)




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;plum&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;plum&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;plum&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["plum"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "plum-shutter-webapp"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.static_webapp.azurerm_static_site.swebapp["plum"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "plum"
      + resource_group_name = "cft-platform-shutter-webapp-sbox-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
    }

  # module.static_webapp.github_actions_secret.secret["plum"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "plum"
      + updated_at      = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1625,"Program":"tfcmt","SHA1":"","Target":"sbox_shutter_webapp","Vars":{}} -->